import React from 'react'
import { useTitle } from 'react-use'
import styles from './index.module.styl'

export default () => {
  useTitle('南大家园 用户协议')

  return (
    <div className={styles.terms}>
      <h1>南大家园 用户协议</h1>
      <p>
        <small>更新于 2020 年 11 月 27 日</small>
      </p>
      <p>欢迎使用南大家园。</p>
      <p>
        请仔细阅读以下条款，如果您对本协议中的任何条款表示异议，您可以选择停止使用南大家园。
        <strong>
          若您使用南大家园提供的服务，或在南大家园中发布任何内容（即「内容」），均视为您（即「用户」）完全接受本协议项下的全部条款。
        </strong>
      </p>
      <h2>一、使用规则</h2>
      <ol>
        <li>
          南大家园将给予每个用户一个用户帐号及相应的密码，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。
        </li>
        <li>
          用户须对在南大家园的注册信息的真实性、合法性、有效性承担全部责任，用户不得冒充他人；不得利用他人的名义发布任何信息；不得恶意使用注册帐号导致其他用户误认；否则南大家园有权立即停止提供服务，收回其帐号并由用户独自承担由此而产生的一切法律责任。
        </li>
        <li>
          用户直接或通过各类方式（如 RSS 源和站外 API
          引用等）间接使用南大家园服务和数据的行为，都将被视作已无条件接受本协议全部内容；若用户对本协议的任何条款存在异议，请停止使用南大家园所提供的全部服务。
        </li>
        <li>
          南大家园是一个信息分享、传播及获取的平台，用户通过南大家园发表的信息为公开的信息，其他第三方均可以通过南大家园获取用户发表的信息，用户对任何信息的发表即认可该信息为公开的信息，并单独对此行为承担法律责任；任何用户不愿被其他第三人获知的信息都不应该在南大家园上进行发表。
        </li>
        <li>
          用户承诺不得以任何方式利用南大家园直接或间接从事违反中国法律以及社会公德的行为，南大家园有权对违反上述承诺的内容予以删除。
        </li>
        <li>
          用户不得利用南大家园服务制作、上载、复制、发布、传播或者转载如下内容：
          <ol>
            <li> 反对宪法所确定的基本原则的；</li>
            <li> 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</li>
            <li> 损害国家荣誉和利益的；</li>
            <li> 煽动民族仇恨、民族歧视，破坏民族团结的；</li>
            <li> 侮辱、滥用英烈形象，否定英烈事迹，美化粉饰侵略战争行为的；</li>
            <li> 破坏国家宗教政策，宣扬邪教和封建迷信的；</li>
            <li> 散布谣言，扰乱社会秩序，破坏社会稳定的；</li>
            <li> 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</li>
            <li> 侮辱或者诽谤他人，侵害他人合法权益的；</li>
            <li> 含有法律、行政法规禁止的其他内容的信息。</li>
          </ol>
        </li>
        <li>
          南大家园有权对用户使用南大家园的情况进行审查和监督，如用户在使用南大家园时违反任何上述规定，南大家园或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户张贴的内容、暂停或终止用户使用南大家园的权利）以减轻用户不当行为造成的影响。
        </li>
      </ol>
      <h2>二、免责声明</h2>
      <ol>
        <li>南大家园不能对用户发表的回答或评论的正确性进行保证。</li>
        <li>
          用户在南大家园ƒ发表的内容仅表明其个人的立场和观点，并不代表南大家园的立场或观点。作为内容的发表者，需自行对所发表内容负责，因所发表内容引发的一切纠纷，由该内容的发表者承担全部法律及连带责任。南大家园不承担任何法律及连带责任。
        </li>
        <li>
          南大家园不保证网络服务一定能满足用户的要求，也不保证网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作保证。
        </li>
        <li>
          对于因不可抗力或南大家园不能控制的原因造成的网络服务中断或其它缺陷，南大家园不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。
        </li>
      </ol>
      <h2>三、协议修改</h2>
      <ol>
        <li>
          根据互联网的发展和有关法律、法规及规范性文件的变化，或者因业务发展需要，南大家园有权对本协议的条款作出修改或变更，一旦本协议的内容发生变动，南大家园将会直接在南大家园官网上公布修改之后的协议内容，该公布行为视为南大家园已经通知用户修改内容。南大家园也可采用电子邮件或私信的传送方式，提示用户协议条款的修改、服务变更、或其它重要事项。
        </li>
        <li>
          根据互联网的发展和有关法律、法规及规范性文件的变化，或者因业务发展需要，南大家园有权对本协议的条款作出修改或变更，一旦本协议的内容发生变动，南大家园将会直接在南大家园官网上公布修改之后的协议内容，该公布行为视为南大家园已经通知用户修改内容。南大家园也可采用电子邮件或私信的传送方式，提示用户协议条款的修改、服务变更、或其它重要事项。
        </li>
      </ol>
    </div>
  )
}
